<?xml version="1.0" ?>
<net batch="1" name="frozen_inference_graph" version="6">
	<layers>
		<layer id="0" name="image_tensor" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Preprocessor/mul/fused_power" precision="FP32" type="Power">
			<data power="1" scale="0.007843137718737125" shift="-1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="FeatureExtractor/MobilenetV2/Conv/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3456"/>
				<biases offset="3456" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="FeatureExtractor/MobilenetV2/Conv/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3584" size="1152"/>
				<biases offset="4736" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4864" size="2048"/>
				<biases offset="6912" size="64"/>
			</blobs>
		</layer>
		<layer id="7" name="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6976" size="6144"/>
				<biases offset="13120" size="384"/>
			</blobs>
		</layer>
		<layer id="8" name="FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13504" size="3456"/>
				<biases offset="16960" size="384"/>
			</blobs>
		</layer>
		<layer id="10" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="17344" size="9216"/>
				<biases offset="26560" size="96"/>
			</blobs>
		</layer>
		<layer id="12" name="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26656" size="13824"/>
				<biases offset="40480" size="576"/>
			</blobs>
		</layer>
		<layer id="13" name="FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="41056" size="5184"/>
				<biases offset="46240" size="576"/>
			</blobs>
		</layer>
		<layer id="15" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46816" size="13824"/>
				<biases offset="60640" size="96"/>
			</blobs>
		</layer>
		<layer id="17" name="FeatureExtractor/MobilenetV2/expanded_conv_2/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="60736" size="13824"/>
				<biases offset="74560" size="576"/>
			</blobs>
		</layer>
		<layer id="19" name="FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="75136" size="5184"/>
				<biases offset="80320" size="576"/>
			</blobs>
		</layer>
		<layer id="21" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="80896" size="18432"/>
				<biases offset="99328" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99456" size="24576"/>
				<biases offset="124032" size="768"/>
			</blobs>
		</layer>
		<layer id="24" name="FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="124800" size="6912"/>
				<biases offset="131712" size="768"/>
			</blobs>
		</layer>
		<layer id="26" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="132480" size="24576"/>
				<biases offset="157056" size="128"/>
			</blobs>
		</layer>
		<layer id="28" name="FeatureExtractor/MobilenetV2/expanded_conv_4/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="157184" size="24576"/>
				<biases offset="181760" size="768"/>
			</blobs>
		</layer>
		<layer id="30" name="FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="182528" size="6912"/>
				<biases offset="189440" size="768"/>
			</blobs>
		</layer>
		<layer id="32" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="190208" size="24576"/>
				<biases offset="214784" size="128"/>
			</blobs>
		</layer>
		<layer id="34" name="FeatureExtractor/MobilenetV2/expanded_conv_5/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<weights offset="214912" size="24576"/>
				<biases offset="239488" size="768"/>
			</blobs>
		</layer>
		<layer id="36" name="FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="240256" size="6912"/>
				<biases offset="247168" size="768"/>
			</blobs>
		</layer>
		<layer id="38" name="FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="247936" size="49152"/>
				<biases offset="297088" size="256"/>
			</blobs>
		</layer>
		<layer id="40" name="FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="297344" size="98304"/>
				<biases offset="395648" size="1536"/>
			</blobs>
		</layer>
		<layer id="41" name="FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="397184" size="13824"/>
				<biases offset="411008" size="1536"/>
			</blobs>
		</layer>
		<layer id="43" name="FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="412544" size="98304"/>
				<biases offset="510848" size="256"/>
			</blobs>
		</layer>
		<layer id="45" name="FeatureExtractor/MobilenetV2/expanded_conv_7/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="511104" size="98304"/>
				<biases offset="609408" size="1536"/>
			</blobs>
		</layer>
		<layer id="47" name="FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="610944" size="13824"/>
				<biases offset="624768" size="1536"/>
			</blobs>
		</layer>
		<layer id="49" name="FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="626304" size="98304"/>
				<biases offset="724608" size="256"/>
			</blobs>
		</layer>
		<layer id="51" name="FeatureExtractor/MobilenetV2/expanded_conv_8/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="724864" size="98304"/>
				<biases offset="823168" size="1536"/>
			</blobs>
		</layer>
		<layer id="53" name="FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="824704" size="13824"/>
				<biases offset="838528" size="1536"/>
			</blobs>
		</layer>
		<layer id="55" name="FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="840064" size="98304"/>
				<biases offset="938368" size="256"/>
			</blobs>
		</layer>
		<layer id="57" name="FeatureExtractor/MobilenetV2/expanded_conv_9/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="938624" size="98304"/>
				<biases offset="1036928" size="1536"/>
			</blobs>
		</layer>
		<layer id="59" name="FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1038464" size="13824"/>
				<biases offset="1052288" size="1536"/>
			</blobs>
		</layer>
		<layer id="61" name="FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1053824" size="147456"/>
				<biases offset="1201280" size="384"/>
			</blobs>
		</layer>
		<layer id="63" name="FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1201664" size="221184"/>
				<biases offset="1422848" size="2304"/>
			</blobs>
		</layer>
		<layer id="64" name="FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1425152" size="20736"/>
				<biases offset="1445888" size="2304"/>
			</blobs>
		</layer>
		<layer id="66" name="FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1448192" size="221184"/>
				<biases offset="1669376" size="384"/>
			</blobs>
		</layer>
		<layer id="68" name="FeatureExtractor/MobilenetV2/expanded_conv_11/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="FeatureExtractor/MobilenetV2/expanded_conv_12/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1669760" size="221184"/>
				<biases offset="1890944" size="2304"/>
			</blobs>
		</layer>
		<layer id="70" name="FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1893248" size="20736"/>
				<biases offset="1913984" size="2304"/>
			</blobs>
		</layer>
		<layer id="72" name="FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="FeatureExtractor/MobilenetV2/expanded_conv_12/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1916288" size="221184"/>
				<biases offset="2137472" size="384"/>
			</blobs>
		</layer>
		<layer id="74" name="FeatureExtractor/MobilenetV2/expanded_conv_12/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="FeatureExtractor/MobilenetV2/expanded_conv_13/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2137856" size="221184"/>
				<biases offset="2359040" size="2304"/>
			</blobs>
		</layer>
		<layer id="76" name="FeatureExtractor/MobilenetV2/expanded_conv_13/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="BoxPredictor_0/BoxEncodingPredictor_depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2361344" size="20736"/>
				<biases offset="2382080" size="2304"/>
			</blobs>
		</layer>
		<layer id="78" name="BoxPredictor_0/BoxEncodingPredictor_depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="BoxPredictor_0/BoxEncodingPredictor/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="12" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>12</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2384384" size="27648"/>
				<biases offset="2412032" size="48"/>
			</blobs>
		</layer>
		<layer id="80" name="BoxPredictor_0/BoxEncodingPredictor/Conv2D/Transpose" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="6420/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2412080" size="12"/>
			</blobs>
		</layer>
		<layer id="82" name="BoxPredictor_0/BoxEncodingPredictor/BiasAdd/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1083</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2412092" size="20736"/>
				<biases offset="2432828" size="2304"/>
			</blobs>
		</layer>
		<layer id="84" name="FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="FeatureExtractor/MobilenetV2/expanded_conv_13/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2435132" size="368640"/>
				<biases offset="2803772" size="640"/>
			</blobs>
		</layer>
		<layer id="86" name="FeatureExtractor/MobilenetV2/expanded_conv_14/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="960" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2804412" size="614400"/>
				<biases offset="3418812" size="3840"/>
			</blobs>
		</layer>
		<layer id="87" name="FeatureExtractor/MobilenetV2/expanded_conv_14/expand/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="960" kernel="3,3" output="960" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3422652" size="34560"/>
				<biases offset="3457212" size="3840"/>
			</blobs>
		</layer>
		<layer id="89" name="FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/Relu6" precision="FP32" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="FeatureExtractor/MobilenetV2/expanded_conv_14/project/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3461052" size="614400"/>
				<biases offset="4075452" size="640"/>
			</blobs>
		</layer>
		<layer id="91" name="FeatureExtractor/MobilenetV2/expanded_conv_14/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="FeatureExtractor/MobilenetV2/expanded_conv_15/expand/BatchNorm/batchnorm/mul_1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="960" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>960</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4076092" size="614400"/>
				<biases offset="4690492" size="3840"/>
			</blobs>
